tutorials/heatTransfer/buoyantSimpleSolver/hotRadiationRoom/0/G
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    fixedWalls
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    ceiling
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    box
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
}

// ************************************************************************* //
